KoppoluMounika/stm32/31_USART2_print_BareMetal/Src/main.c
#include "stm32l4xx.h"
#include <stdio.h>

#define SYS_FREQ       16000000
#define UART_BAUDRATE  9600

void UART2_Init(void);
void UART2_Write(int ch);
int __io_putchar(int ch);

int main(void)
{
    /*********** Enable 16 MHz HSI Clock ***********/
    RCC->CR |= (1 << 8);               // Enable HSI
    while (!(RCC->CR & (1 << 10)));    // Wait till HSI ready
    RCC->CFGR |= (1 << 0);             // Select HSI as system clock

    UART2_Init();

    while (1)
    {
        printf("HELLO STM32\r\n");
        for (volatile int i = 0; i < 1000000; i++); // delay
    }
}

void UART2_Init(void)
{
    /*********** Enable Clocks ***********/
    RCC->APB1ENR1 |= (1 << 17);   // USART2EN
    RCC->AHB2ENR  |= (1 << 0);    // GPIOAEN

    /*********** Configure PA2 (TX) ***********/
    GPIOA->MODER &= ~(3 << (2 * 2)); // clear mode
    GPIOA->MODER |=  (2 << (2 * 2)); // alternate function
    GPIOA->AFR[0] &= ~(0xF << (4 * 2));
    GPIOA->AFR[0] |=  (7 << (4 * 2)); // AF7 = USART2_TX

    /*********** Configure USART2 ***********/
    USART2->BRR = (SYS_FREQ + (UART_BAUDRATE / 2U)) / UART_BAUDRATE;
    USART2->CR1 = (1 << 3); // TE enable
    USART2->CR1 |= (1 << 0); // USART enable
}

void UART2_Write(int ch)
{
    while (!(USART2->ISR & (1 << 7))); // TXE flag
    USART2->TDR = (ch & 0xFF);
}

int __io_putchar(int ch)
{
    UART2_Write(ch);
    return ch;
}
